pitzDaily/fullChemistry/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel  PaSR<psiChemistryCombustion>;

active  true;

PaSRCoeffs
{
    Cmix                0.1;
    turbulentReaction   on;
    useReactionRate     true;
}

/*
combustionModel  laminar<psiChemistryCombustion>;

active  true;

laminarCoeffs
{
}
*/

// ************************************************************************* //
